In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import sqlite3

In [2]:
conn = sqlite3.connect('Data/im.db')

In [3]:
cursor = conn.cursor()

In [16]:
# Filter movies with 100 or more votes
df_imdb_filtered = df_imdb[df_imdb['numvotes'] >= 100]

# Sort by average rating in descending order
df_imdb_filtered = df_imdb_filtered.sort_values(by='averagerating', ascending=False)
df_imdb_filtered.info()

<class 'pandas.core.frame.DataFrame'>
Index: 27965 entries, 73343 to 13502
Data columns (total 8 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   movie_id         27965 non-null  object
 1   title            27965 non-null  object
 2   original_title   27965 non-null  object
 3   start_year       27965 non-null  int64
 4   runtime_minutes  27965 non-null  float64
 5   genres           27965 non-null  object
 6   averagerating    27965 non-null  float64
 7   numvotes         27965 non-null  int64
dtypes: float64(2), int64(2), object(4)
memory usage: 1.9+ MB

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0462036   nm1940585
2       tt0835418   nm0151540
3       tt0835418   nm0151540
4       tt0878654   nm0089502
...           ...         ...
291169  tt8999974  nm10122357
291170  tt9001390   nm6711477
291171  tt9001494  nm10123242
291172  tt9001494  nm10123248
291173  tt9004986   nm4993825

[291174 rows x 2 columns]

In [19]:
directors_table['person_id'].nunique()

109253

In [11]:
directors_table['person_id'].value_counts()

person_id
nm6935209     238
nm2563700     190
nm1546474     185
nm3877467     180
nm3848412     144
             ...
nm8950870       1
nm6461704       1
nm8963989       1
nm7094378       1
nm10123248      1
Name: count, Length: 109253, dtype: int64

Join with persons table to get the primary name

,person_id,primary_name,birth_year,death_year,primary_profession
0,nm0061671,Mary Ellen Bauder,NaN,NaN,"miscellaneous,production_manager,producer"
1,nm0061865,Joseph Bauer,NaN,NaN,"composer,music_department,sound_department"
2,nm0062070,Bruce Baum,NaN,NaN,"miscellaneous,actor,writer"
3,nm0062195,Axel Baumann,NaN,NaN,"camera_department,cinematographer,art_department"
4,nm0062798,Pete Baxter,NaN,NaN,"production_designer,art_department,set_decorator"
...,...,...,...,...,...
606643,nm9990381,Susan Grobes,NaN,NaN,actress
606644,nm9990690,Joo Yeon So,NaN,NaN,actress
606645,nm9991320,Madeline Smith,NaN,NaN,actress
606646,nm9991786,Michelle Modigliani,NaN,NaN,producer
606647,nm9993380,Pegasus EnvoyÃ©,NaN,NaN,"director,actor,writer"

In [21]:
persons_table.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 606648 entries, 0 to 606647
Data columns (total 5 columns):
 #   Column              Non-Null Count   Dtype
---  ------              --------------   -----
 0   person_id           606648 non-null  object
 1   primary_name        606648 non-null  object
 2   birth_year          82736 non-null   float64
 3   death_year          6783 non-null    float64
 4   primary_profession  555308 non-null  object
dtypes: float64(2), object(3)
memory usage: 23.1+ MB

In [22]:
writers_table = pd.read_sql("""SELECT * FROM writers;""", conn)
writers_table

         movie_id   person_id
0       tt0285252   nm0899854
1       tt0438973   nm0175726
2       tt0438973   nm1802864
3       tt0462036   nm1940585
4       tt0835418   nm0310087
...           ...         ...
255868  tt8999892  nm10122246
255869  tt8999974  nm10122357
255870  tt9001390   nm6711477
255871  tt9004986   nm4993825
255872  tt9010172   nm8352242

[255873 rows x 2 columns]

In [30]:
director_stats['movie_count'].value_counts().head(15)

movie_count
1     22769
2     12245
3      5564
4      3241
5      1822
6      1287
7       865
8       653
9       539
10      422
11      321
12      269
13      202
14      153
15      150
Name: count, dtype: int64

          primary_name  movie_count
43658       Shane Ryan          155
47953      Tony Newton          130
41360  Ruben Rodriguez          129
9523      Corey Norman          107
20890      Jason Impey          102
14680     Evan Marlowe          100

      primary_name  movie_count  avg_rating
0       Shane Ryan          155    5.626452
1      Tony Newton          130    4.785385
2  Ruben Rodriguez          129    6.079845
3     Corey Norman          107    6.017757
4      Jason Impey          102    5.158824
5     Evan Marlowe          100    6.403000

In [ ]:
#conn.close()